{
    "rawContent": "<div class=\"post-body\">\n    <h1>\n      Tìm hiểu về Blockchain\n    </h1>\n    <h2>\n      Công nghệ Blockchain xuất hiện đã mở ra một xu hướng mới cho các lĩnh vực như: tài chính ngân hàng, logistics, điện tử viễn thông, kế toán kiểm toán,... Vậy blockchain là gì? Có thể làm được những gì?\n    </h2>\n    <div class=\"clrindexknh\">\n      <div id=\"QuickViewId\" class=\"bxindexknh\">\n        <p class=\"indxtitle\" onclick=\"togidxknh()\">\n          Xem nhanh <i class=\"faq-idxknh\"></i>\n        </p>\n        <div class=\"ctindxknh\">\n          <h5 class=\"\">\n            <a href=\"#hmenuid1\" data-id=\"hmenuid1\" onclick=\"autoCloseMenu(this, event)\">1. Blockchain là gì? (khái niệm,\n              phân loại, phiên bản mới\n              nhất)</a>\n          </h5>\n          <div class=\"subh\"></div>\n          <h5 class=\"\">\n            <a href=\"#hmenuid2\" data-id=\"hmenuid2\" onclick=\"autoCloseMenu(this, event)\">2. Các đặc điểm nổi bật của\n              Blockchain</a>\n          </h5>\n          <div class=\"subh\"></div>\n          <h5 class=\"\">\n            <a href=\"#hmenuid3\" data-id=\"hmenuid3\" onclick=\"autoCloseMenu(this, event)\">3. Blockchain hoạt động như thế\n              nào</a>\n          </h5>\n          <div class=\"subh\"></div>\n          <h5 class=\"\">\n            <a href=\"#hmenuid4\" data-id=\"hmenuid4\" onclick=\"autoCloseMenu(this, event)\">4. Ứng dụng thực tiễn của công\n              nghệ Blockchain trong cuộc\n              sống</a>\n          </h5>\n          <div class=\"subh\"></div>\n          \n        </div>\n      </div>\n    </div>\n\n    <h3 id=\"hmenuid1\">\n      Blockchain là gì? (khái niệm, phân loại, phiên bản mới nhất)\n    </h3>\n\n    <p><strong>Khái niệm</strong></p>\n\n    <p>\n      Blockchain là công nghệ chuỗi – khối, cho phép\n      <strong>truyền tải dữ liệu</strong> một cách an toàn dựa trên hệ thống\n      <strong>mã hóa</strong> vô cùng phức tạp, tương tự như cuốn sổ cái kế\n      toán của một công ty, nơi mà tiền được giám sát chặt chẽ và ghi nhận mọi\n      giao dịch trên mạng ngang hàng.&nbsp;\n    </p>\n\n    <p>\n      Mỗi khối (block) đều chứa thông tin về thời gian khởi tạo và được liên\n      kết với khối trước đó, kèm theo đó là một mã thời gian và dữ liệu giao\n      dịch. Dữ liệu khi đã được mạng lưới chấp nhận thì sẽ không có cách nào\n      thay đổi được. Blockchain được thiết kế để\n      <strong>chống lại việc gian lận, thay đổi của dữ liệu.</strong>\n    </p>\n\n    <p>\n      <img alt=\"Một chuỗi khối bao gồm các danh sách ghi chép được liên kết và bảo mật thông tin.\" height=\"356\"\n        title=\"Một chuỗi khối bao gồm các danh sách ghi chép được liên kết và bảo mật thông tin.\" width=\"730\"\n        class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-2.png\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-2.png\"\n        style=\"display: block; opacity: 1\" />\n    </p>\n\n    <p>\n      <strong>Công nghệ Blockchain – sự kết hợp giữa 3 loại công nghệ:</strong>\n    </p>\n\n    <ul>\n      <li>\n        <strong>Mật mã học</strong>: để đảm bảo tính minh bạch, toàn vẹn và\n        riêng tư thì công nghệ Blockchain đã sử dụng public key và hàm hash\n        function.\n      </li>\n      <li>\n        <strong>Mạng ngang hàng</strong>: Mỗi một nút trong mạng được xem như\n        một client và cũng là server để lưu trữ bản sao ứng dụng.\n      </li>\n      <li>\n        <strong>Lý thuyết trò chơi</strong>: Tất cả các nút tham gia vào hệ\n        thống đều phải tuân thủ luật chơi đồng thuận (giao thức PoW, PoS,…) và\n        được thúc đẩy bởi động lực kinh tế.\n      </li>\n    </ul>\n\n    <p><strong>Hệ thống Blockchain chia thành 3 loại chính:</strong></p>\n\n    <ul>\n      <li>\n        <strong>Public:</strong> Bất kỳ ai cũng có quyền đọc và ghi dữ liệu\n        trên Blockchain. Quá trình xác thực giao dịch trên Blockchain này đòi\n        hỏi phải có rất nhiều nút tham gia. Vì vậy, muốn tấn công được vào hệ\n        thống Blockchain này cần chi phí rất lớn và thực sự không khả thi. Ví\n        dụ: Bitcoin, Ethereum,…\n      </li>\n      <li>\n        <strong>Private:</strong> Người dùng chỉ được quyền đọc dữ liệu, không\n        có quyền ghi vì điều này thuộc về bên tổ chức thứ ba tuyệt đối tin\n        cậy. Vì đây là một Private Blockchain, cho nên thời gian xác nhận giao\n        dịch khá nhanh vì chỉ cần một lượng nhỏ thiết bị tham gia xác thực\n        giao dịch. Ví dụ: Ripple là một dạng Private Blockchain, hệ thống này\n        cho phép 20% các nút là gian dối và chỉ cần 80% còn lại hoạt động ổn\n        định là được.\n      </li>\n      <li>\n        <strong>Permissioned (hay còn gọi là Consortium):</strong> một dạng\n        của Private nhưng bổ sung thêm 1 số tính năng khác, đây là sự kết hợp\n        giữa Public và Private. Ví dụ: Các ngân hàng hay tổ chức tài chính\n        liên doanh sẽ sử dụng Blockchain cho riêng mình.\n      </li>\n    </ul>\n\n    <p>\n      <img alt=\"Hệ thống Blockchain gồm 3 loại chính\" style=\"width: 730px; height: 250px; display: block; opacity: 1\"\n        title=\"Hệ thống Blockchain gồm 3 loại chính\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-4.png\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-4.png\" />\n    </p>\n\n    <p><strong>Các phiên bản của công nghệ Blockchain</strong></p>\n\n    <ul>\n      <li>\n        <strong>Công nghệ Blockchain 1.0</strong> – Tiền tệ và Thanh toán: Ứng\n        dụng chính của phiên bản này là tiền mã hoá: bao gồm việc chuyển đổi\n        tiền tệ, kiều hối và tạo lập hệ thống thanh toán kỹ thuật số. Đây cũng\n        là lĩnh vực quen thuộc với chúng ta nhất mà đôi khi khá nhiều người\n        lầm tưởng Bitcoin và Blockchain là một.\n      </li>\n      <li>\n        <strong>Công nghệ Blockchain 2.0</strong> – Tài chính và Thị trường:\n        Ứng dụng xử lý tài chính và ngân hàng: mở rộng quy mô của Blockchain,\n        đưa vào các ứng dụng tài chính và thị trường. Các tài sản bao gồm cổ\n        phiếu, chi phiếu, nợ, quyền sở hữu và bất kỳ điều gì có liên quan đến\n        thỏa thuận hay hợp đồng.\n      </li>\n      <li>\n        <strong>Công nghệ Blockchain 3.0</strong> – Thiết kế và Giám sát hoạt\n        động:&nbsp; Đưa Blockchain vượt khỏi biên giới tài chính, và đi vào\n        các lĩnh vực như giáo dục, chính phủ, y tế và nghệ thuật.&nbsp;\n      </li>\n    </ul>\n\n    <p>\n      <img alt=\"Blockchain 3.0\" height=\"500\" title=\"Blockchain 3.0\" width=\"730\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-3.jpg\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-3.jpg\"\n        style=\"display: block; opacity: 1\" />\n    </p>\n\n    <h3 id=\"hmenuid2\">Các đặc điểm nổi bật của Blockchain</h3>\n\n    <p>Blockchain có các đặc điểm nổi bật sau:</p>\n\n    <ul>\n      <li>\n        <strong>Không thể làm giả, không thể phá hủy các chuỗi Blockchain:</strong>\n        theo như lý thuyết thì chỉ có máy tính lượng tử mới có thể giải mã\n        Blockchain và công nghệ Blockchain biến mất khi không còn Internet\n        trên toàn cầu.\n      </li>\n      <li>\n        <strong>Bất biến:</strong> dữ liệu trong Blockchain không thể sửa (có\n        thể sửa nhưng sẽ để lại dấu vết) và sẽ lưu trữ mãi mãi.\n      </li>\n      <li>\n        <strong>Bảo mật:</strong> Các thông tin, dữ liệu trong Blockchain được\n        phân tán và an toàn tuyệt đối.\n      </li>\n      <li>\n        <strong>Minh bạch:</strong> Ai cũng có thể theo dõi dữ liệu Blockchain\n        đi từ địa chỉ này tới địa chỉ khác và có thể thống kê toàn bộ lịch sử\n        trên địa chỉ đó.\n      </li>\n      <li>\n        <strong>Hợp đồng thông minh:</strong> là hợp đồng kỹ thuật số được\n        nhúng vào đoạn code if-this-then-that (IFTTT), cho phép chúng tự thực\n        thi mà không cần bên thứ ba.\n      </li>\n    </ul>\n\n    <p>\n      <img alt=\"Các đặc điểm của Blockchain\" height=\"512\" title=\"Các đặc điểm của Blockchain\" width=\"730\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-5.jpg\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-5.jpg\"\n        style=\"display: block; opacity: 1\" />\n    </p>\n\n    <h3 id=\"hmenuid3\">\n      <span class=\"dropcap\" data-crown=\"\">3</span>Blockchain hoạt động như thế\n      nào\n    </h3>\n\n    <p>\n      Ứng dụng được biết đến và thảo luận nhiều nhất về công nghệ Blockchain\n      chính là<strong> đồng tiền điện tử</strong>.&nbsp;Bitcoin là một đơn vị\n      tiền tệ kỹ thuật số với mã là BTC, cũng giống như đô la Mỹ bản thân nó\n      không mang giá trị, nó chỉ có giá trị bởi vì có một cộng đồng đồng ý sử\n      dụng nó làm đơn vị giao dịch hàng hóa và dịch vụ.\n    </p>\n\n    <p>\n      Để theo dõi số lượng Bitcoin mà mỗi người sở hữu trong các tài khoản\n      nhất định và theo dõi các giao dịch phát sinh từ đó thì chúng ta cần đến\n      một <strong>cuốn sổ kế toán</strong>, trong trường hợp này nó chính là\n      Blockchain và đây thực tế là một tệp kỹ thuật số theo dõi tất cả các\n      giao dịch Bitcoin.\n    </p>\n\n    <p>\n      <img alt=\"Ứng dụng được biết đến và thảo luận nhiều nhất về công nghệ Blockchain chính là đồng tiền điện tử \"\n        height=\"293\"\n        title=\"Ứng dụng được biết đến và thảo luận nhiều nhất về công nghệ Blockchain chính là đồng tiền điện tử \"\n        width=\"730\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-7.png\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-7.png\"\n        style=\"display: block; opacity: 1\" />\n    </p>\n\n    <p>\n      Tệp sổ cái này không được lưu trữ trong một máy chủ trung tâm, như trong\n      một ngân hàng hoặc trong một trung tâm dữ liệu mà ngược lại nó được phân\n      phối trên toàn thế giới thông qua một mạng lưới các máy tính ngang hàng\n      với vai trò lưu trữ dữ liệu và thực thi các tính toán. Mỗi máy tính này\n      đại diện cho một “nút” của mạng lưới Blockchain và mỗi nút đều có một\n      bản sao của tệp sổ cái này.\n    </p>\n\n    <div class=\"infobox\">\n      <strong>Một ví dụ dễ hiểu về giao thức chuyển tiền điện tử</strong>\n\n      <p>\n        Nếu David muốn gửi Bitcoin cho Sandra, anh ta sẽ phát một thông báo\n        tới mạng lưới và cho biết số lượng Bitcoin trong tài khoản của mình sẽ\n        giảm 5 BTC và số lượng Bitcoin trong tài khoản của Sandra sẽ tăng lên\n        tương ứng. Mỗi nút trong mạng sau đó sẽ nhận được thông báo này và ánh\n        sạ giao dịch được yêu cầu vào bản sao sổ cái kế toán của họ, và theo\n        đó số dư tài khoản của cả hai bên đều được cập nhật.\n      </p>\n\n      Nếu David muốn gửi Bitcoin cho Sandra, anh ta sẽ phát một thông báo tới\n      mạng lưới và cho biết số lượng Bitcoin trong tài khoản của mình sẽ giảm\n      5 BTC và số lượng Bitcoin trong tài khoản của Sandra sẽ tăng lên tương\n      ứng. Mỗi nút trong mạng sau đó sẽ nhận được thông báo này và ánh sạ giao\n      dịch được yêu cầu vào bản sao sổ cái kế toán của họ, và theo đó số dư\n      tài khoản của cả hai bên đều được cập nhật.\n    </div>\n\n    <p><strong>Nguyên lý mã hoá</strong></p>\n\n    <p>\n      <img alt=\"Nguyên lý mã hóa\" height=\"400\" title=\"Nguyên lý mã hóa\" width=\"730\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-13-2.jpg\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-13-2.jpg\"\n        style=\"display: block; opacity: 1\" />\n    </p>\n\n    <p>\n      Trên thực tế, cuốn sổ cái luôn được duy trì bởi các máy tính trong\n      <strong>mạng ngang hàng</strong> được kết nối với nhau. Vì thế, nó sẽ có\n      một số điểm khác biệt:\n    </p>\n\n    <ul>\n      <li>\n        Trong hệ thống ngân hàng, chúng ta chỉ biết các giao dịch và số dư tài\n        khoản của riêng mình thì trên Blockchain của bitcoin bạn có thể xem\n        các giao dịch của tất cả mọi người.&ZeroWidthSpace;\n      </li>\n      <li>\n        Mạng lưới Bitcoin là mạng lưới phân tán không cần\n        <strong>bên thứ ba đóng vai trò trung gian</strong> xử lý giao\n        dịch.&ZeroWidthSpace;\n      </li>\n      <li>\n        Hệ thống Blockchain được thiết kế theo cách không yêu cầu sự tin cậy\n        và bảo đảm bởi độ tin cậy có được thông qua các hàm mã hóa toán học\n        đặc biệt.&ZeroWidthSpace;\n      </li>\n    </ul>\n\n    <p>\n      Để có thể thực hiện các giao dịch trên Blockchain, bạn cần một phần mềm\n      sẽ cho phép bạn lưu trữ và trao đổi các đồng Bitcoin của bạn gọi là ví\n      tiền điện tử. Ví tiền điện tử này sẽ được bảo vệ bằng một phương pháp mã\n      hóa đặc biệt đó là sử dụng một cặp khóa bảo mật duy nhất:\n      <strong>khóa riêng tư (private key) và khóa công khai (public key)</strong>.\n    </p>\n\n    <p>\n      Nếu một thông điệp được mã hóa bằng một khóa công khai cụ thể thì chỉ\n      chủ sở hữu của khóa riêng tư là một cặp với khóa công khai này mới có\n      thể giải mã và đọc nội dung thông điệp.\n    </p>\n\n    <p>\n      Khi mã hóa một yêu cầu giao dịch bằng khóa riêng tư, có nghĩa là bạn\n      đang tạo ra một chữ ký điện tử được các máy tính trong mạng lưới\n      Blockchain sử dụng để kiểm tra chủ thể gửi và tính xác thực của giao\n      dịch. Chữ ký này là một chuỗi văn bản và là sự kết hợp của yêu cầu giao\n      dịch và khóa riêng tư của bạn.\n    </p>\n\n    <p>\n      <img alt=\"Nguyên lí hoạt động của blockchain\" style=\"width: 730px; height: 359px; display: block; opacity: 1\"\n        title=\"Nguyên lí hoạt động của blockchain\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain1.jpg\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain1.jpg\" />\n    </p>\n\n    <p>\n      Nếu một ký tự đơn trong thông điệp yêu cầu giao dịch này bị thay đổi thì\n      chữ ký điện tử sẽ thay đổi theo. Vì thế, hacker khó có thể thay đổi yêu\n      cầu giao dịch của bạn hoặc thay đổi số lượng Bitcoin mà bạn đang gửi.\n    </p>\n\n    <p>\n      Để gửi Bitcoin (BTC), bạn cần chứng minh rằng bạn sở hữu khóa riêng tư\n      của một chiếc ví điện tử cụ thể bởi bạn cần sử dụng nó để mã hóa thông\n      điệp yêu cầu giao dịch. Sau khi tin nhắn của bạn đã được gửi đi và được\n      mã hóa thì bạn không cần phải tiết lộ khóa riêng tư của bạn nữa.\n    </p>\n\n    <p><strong>Quy tắc của sổ cái</strong></p>\n\n    <p>\n      Mỗi nút trong Blockchain đều đang\n      <strong>lưu giữ một bản sao</strong> của sổ kế toán. Do vậy, mỗi nút đều\n      biết số dư tài khoản của bạn là bao nhiêu. Hệ thống Blockchain chỉ ghi\n      lại mỗi giao dịch được yêu cầu chứ không hề theo dõi số dư tài khoản của\n      bạn.\n    </p>\n\n    <p>\n      Để biết số dư trên ví điện tử của mình thì bạn cần xác thực và xác nhận\n      tất cả các giao dịch đã diễn ra trên mạng lưới mà có liên quan tới ví\n      điện tử của bạn.\n    </p>\n\n    <p>\n      Việc xác minh “số dư” này được thực hiện nhờ các tính toán dựa vào liên\n      kết đến các giao dịch trước đó. Nhìn vào hình trên, để gửi 10 BTC cho\n      John, Mary cần tạo yêu cầu giao dịch bao gồm các liên kết đến các giao\n      dịch đã diễn ra trước đó với tổng số dư bằng hoặc vượt quá 10 BTC.\n    </p>\n\n    <p>\n      <img alt=\"Xác minh số dư trong ví điện tử\" height=\"404\" title=\"Xác minh số dư trong ví điện tử\" width=\"730\"\n        class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-8.png\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-8.png\"\n        style=\"display: block; opacity: 1\" />\n    </p>\n\n    <p>\n      Các liên kết này được xem như là giá trị đầu vào, các nút trong mạng\n      lưới sẽ xác minh xem tổng số tiền của các giao dịch này bằng hoặc vượt\n      quá 10 BTC không. Tất cả điều này được thực hiện tự động trong ví điện\n      tử của Mary và được kiểm tra bởi các nút trên mạng lưới Bitcoin, Mary\n      chỉ gửi một giao dịch 10 bitcoin tới ví của John bằng khóa công khai của\n      John.\n    </p>\n\n    <p>\n      <img alt=\"Tham chiếu lịch sử giao dịch\" height=\"339\" title=\"Tham chiếu lịch sử giao dịch\" width=\"730\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-9.png\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-9.png\"\n        style=\"display: block; opacity: 1\" />\n    </p>\n\n    <p>\n      Thực tế là các nút sẽ kiểm tra tất cả các giao dịch có liên quan đến ví\n      tiền điện tử bạn sử dụng trước đó để gửi Bitcoin (BTC) thông qua việc\n      tham chiếu các lịch sử giao dịch. Có một bản ghi sẽ lưu trữ số BTC chưa\n      được dùng và được các nút mạng lưu giữ giúp đơn giản hóa và tăng tốc quá\n      trình xác minh. Vì thế, các ví tiền điện tử tránh được tình trạng chi\n      tiêu đúp giao dịch.\n    </p>\n\n    <p>\n      Mã nguồn trên mạng lưới Bitcoin là<strong> </strong>nguồn mở, có nghĩa\n      là bất kỳ ai có máy tính kết nối được internet đều có thể tham gia vào\n      mạng lưới và thực hiện giao dịch.\n    </p>\n\n    <p>\n      Tuy nhiên, nếu có bất kỳ một\n      <strong>lỗi nào trong mã nguồn </strong>được sử dụng để phát thông báo\n      yêu cầu giao dịch thì các Bitcoin liên quan sẽ bị mất vĩnh viễn.\n    </p>\n\n    <p>\n      Hãy nhớ rằng, sẽ không có bộ phận hỗ trợ khách hàng hoặc không hề có bất\n      cứ ai có thể giúp bạn khôi phục lại một giao dịch bị mất hoặc quên mật\n      khẩu ví tiền điện tử của bạn vì đây là mạng phân tán. Vì thế, bạn cần\n      phải <strong>lưu trữ</strong> mật khẩu hoặc khóa riêng tư của ví của bạn\n      cực kỳ <strong>cẩn thận và an toàn</strong>.\n    </p>\n\n    <p><strong>Nguyên lý tạo khối</strong></p>\n\n    <p>\n      Các giao dịch sau khi được gửi lên trên mạng lưới Blockchain sẽ được\n      nhóm vào các khối và các giao dịch trong cùng 1 khối (block) được coi là\n      đã xảy ra cùng thời điểm. Các giao dịch chưa được thực hiện trong 1 khối\n      được coi là chưa được xác nhận.\n    </p>\n\n    <p>\n      <img alt=\"Nguyên lý tạo khối\" height=\"295\" title=\"Nguyên lý tạo khối\" width=\"730\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-12.png\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-la-gi-hoat-dong-cua-blockchain-nhu-the-nao-ung-dung-ra-sao-12.png\"\n        style=\"display: block; opacity: 1\" />\n    </p>\n\n    <p>\n      Mỗi nút có thể nhóm các giao dịch với nhau thành một khối và gửi nó vào\n      mạng lưới như một hàm ý cho các khối tiếp theo được gắn vào sau đó. Bất\n      kỳ nút nào cũng có thể tạo ra một khối mới. Vậy, câu hỏi đặt ra là: hệ\n      thống sẽ đồng thuận với khối nào? khối nào sẽ là khối tiếp theo?\n    </p>\n\n    <p>\n      Để được thêm vào Blockchain, mỗi khối phải chứa một đoạn mã đóng vai trò\n      như một đáp án cho một vấn đề toán học phức tạp được tạo ra bằng<strong>\n        hàm mã hóa băm không thể đảo ngược</strong>.\n    </p>\n\n    <p>\n      Cách duy nhất để giải quyết vấn đề toán học như vậy là\n      <strong>đoán các số ngẫu nhiên</strong>, những số khi mà kết hợp với nội\n      dung khối trước tạo ra một kết quả đã được hệ thống định nghĩa. Điều này\n      nhiều khi có thể mất khoảng một năm cho một máy tính điển hình với một\n      cấu hình cơ bản có thể đoán đúng các con số đáp án của vấn đề toán học\n      này.\n    </p>\n\n    <p>\n      <img alt=\"cấu trúc blockchain\" style=\"width: 730px; height: 486px; display: block; opacity: 1\"\n        title=\"cấu trúc blockchain\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-1.jpg\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/blockchain-1.jpg\" />\n    </p>\n\n    <p>\n      Mạng lưới quy định mỗi khối được tạo ra sau một quãng thời gian là\n      <strong>10 phút </strong>một lần, bởi vì trong mạng lưới luôn có một số\n      lượng lớn các máy tính đều tập trung vào việc đoán ra dãy số này. Nút\n      nào giải quyết được vấn đề toán học như vậy sẽ được quyền gắn khối tiếp\n      theo lên trên chuỗi và gửi nó tới toàn bộ mạng lưới.\n    </p>\n\n    <p>\n      Vậy điều gì sẽ xảy ra nếu hai nút giải quyết cùng một vấn đề cùng một\n      lúc và truyền các khối kết quả của chúng đồng thời lên mạng lưới? Trong\n      trường hợp này, cả hai khối được gửi lên mạng lưới và mỗi nút sẽ xây\n      dựng các khối kế tiếp trên khối mà nó nhận được trước tiên.\n    </p>\n\n    <p>\n      Tuy nhiên, hệ thống Blockchain luôn yêu cầu mỗi nút phải xây dựng trên\n      chuỗi khối dài nhất mà nó nhận được. Vì vậy, nếu có sự mơ hồ về việc\n      block nào là khối cuối cùng thì ngay sau khi khối tiếp theo được giải\n      quyết thì mỗi nút sẽ áp dụng vào <strong>chuỗi dài nhất</strong>.\n    </p>\n\n    <p>\n      <img alt=\"Chuỗi blockchain\" style=\"width: 730px; height: 487px; display: block; opacity: 1\"\n        title=\"Chuỗi blockchain\" class=\"lazy\"\n        data-src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/istock-913016488.jpg\"\n        src=\"https://cdn.tgdd.vn/Files/2019/06/05/1171145/istock-913016488.jpg\" />\n    </p>\n\n    <p>\n      Do xác suất việc xây dựng các block đồng thời là rất thấp nên hầu như\n      không có trường hợp nhiều khối được giải quyết cùng một lúc và nhiều lần\n      tạo ra các khối nối đuôi khác nhau. Do đó, toàn bộ chuỗi-khối sẽ nhanh\n      chóng ổn định và hợp nhất lại khi mà mọi nút đều đồng thuận.\n    </p>\n\n    <h3 id=\"hmenuid4\">\n      Ứng dụng thực tiễn của công nghệ Blockchain trong cuộc sống\n    </h3>\n\n    <p>\n      Một số ngành công nghiệp mà công nghệ Blockchain có thể<strong>\n        tác động</strong>\n      đến như:\n    </p>\n\n    <ul>\n      <li>Công nghệ ô tô Automotive (Automotive)</li>\n      <li>Chế tạo (Manufacturing)</li>\n      <li>\n        Công nghệ, truyền thông và viễn thông (Tech, media &amp;\n        Telecommunications)\n      </li>\n      <li>Dịch vụ tài chính (Financial Services)</li>\n      <li>Nghệ thuật &amp; Giải trí (Art &amp; Recreation)</li>\n      <li>Chăm sóc sức khỏe (Healthcare)</li>\n      <li>Bảo hiểm (Insurance)</li>\n      <li>Bán lẻ (Retail)</li>\n      <li>Khu vực công (Public Sector)</li>\n      <li>Bất động sản (Property)</li>\n      <li>Nông nghiệp (Agricultural)</li>\n      <li>Khai thác (Mining)</li>\n      <li>Vận tải và Logistics (Transport &amp; Logistics)</li>\n      <li>Công trình hạ tầng kỹ thuật (Utility)</li>\n    </ul>\n\n  \n\n    <p>\n      <em>Hiện nay có rất nhiều công ty và tập đoàn lớn đang xây dựng mạng lưới\n        của riêng mình bằng công nghệ Blockchain. Chắc chắn rằng Blockchain sẽ\n        tạo nên một cuộc cách mạng trong vài năm tới ở Việt Nam và đóng vai\n        trò ngày càng lớn trong việc thay đổi thế giới CNTT.</em>\n    </p>\n    </div>",
    "authorName": "Duc Minh",
    "timeRelease": "2021-11-07T19:40:21Z",
    "timeCreate": "2021-11-07T08:10:51Z",
    "title": "Tìm hiểu về Blockchain",
    "subTitle": "Công nghệ Blockchain xuất hiện đã mở ra một xu hướng mới cho các lĩnh vực như: tài chính ngân hàng, logistics, điện tử viễn thông, kế toán kiểm toán,... Vậy blockchain là gì? Có thể làm được những gì?",
    "coverImgUrl": "https://i.postimg.cc/tR17KgDN/IMG-7546.jpg",
    "thumbnailImgUrl": "https://i.postimg.cc/28YRybpq/d6668078-23db-42d3-b311-ea0a97dbd6e6.gif",
    "blogTag": ["Blockchain", "Fintech"]
  }

  