{
    "rawContent": "<div class="post-body">
    <figure>
      <img
        src="https://i.postimg.cc/PrXv9R9b/HTML-thumbnail.png"
        referrerpolicy="no-referrer"
        alt="gioi-thieu-cac-the-co-ban-trong-html-thumbnail"
      />
      <figcaption>Introduction to HTML tag</figcaption>
    </figure>
    <h1 id="gioi-thieu">Giới thiệu</h1>
    <p>
      Xin chào các bạn, ngày nay HTML hay Hypertext Markup Language đã trở thành
      một ngôn ngữ phổ biến và rộng rãi hơn với tất cả mọi người. Nếu các bạn muốn
      tìm hiểu về lập trình web, việc biết đến HTML là điều cần phải có, bởi vì dù
      trang web có đơn giản hay phức tạp thì đều có phần HTML làm khung xương,
      khung xương vững chắc thì những thành phần khác mới xây lên một cách dễ dàng
      được. Vậy thì hôm nay mình sẽ cùng các bạn tìm hiểu về một số thẻ cơ bản và
      thông dụng nhất trong HTML nhé.
    </p>
    <h1 id="phan-loai-the-trong-html">Phân loại thẻ trong HTML</h1>
    <h2 id="phan-loai-theo-cau-truc">Phân loại theo cấu trúc</h2>
    <p>
      Ở trong HTML, các bạn sẽ dễ dàng nhận ra được cấu trúc khác nhau cơ bản của
      2 loại thẻ chính: thẻ có thẻ mở và thẻ đóng, và thẻ tự đóng.
    </p>
    <pre><code class='language-html' lang='html'>&lt;p&gt;Welcome to GDSC-HUST&lt;/p&gt;
          </code></pre>
    <p>
      Ở trên mình có thẻ p với <code>&lt;p&gt;</code> là thẻ mở sau đó đến nội
      dung là <code>Welcome to GDSC-HUST</code> rồi đến thẻ đóng là
      <code>&lt;/p&gt;</code>, các bạn thấy thẻ đóng nó giống thẻ mở nhưng có dấu
      <code>/</code> phía trước nhé. Ngoài ra các bạn sẽ thường gặp những thẻ tự
      đóng có cấu trúc như sau:
    </p>
    <pre><code class='language-html' lang='html'>&lt;img src=&quot;&quot; alt=&quot;&quot;/&gt;
          </code></pre>
    <p>
      Những thẻ có cấu trúc như trên gọi là thẻ tự đóng nghĩa là chúng ta không
      thể truyền nội dung vào giữa như thẻ đóng mở ở chỗ thẻ p mình nói ở trên.
      Các bạn cần lưu ý những thẻ nào là thẻ có thẻ mở và thẻ đóng và những thẻ
      nào tự đóng để code chuẩn hơn và tránh gặp lỗi nhé.
    </p>
    <h2 id="phan-loai-theo-tinh-chat">Phân loại theo tính chất</h2>
    <p>
      Khi làm quen với HTML, chúng ta có thể thấy được có những thẻ có tính chất,
      đặc điểm, hành vi trên web khác với thẻ khác, vì vậy dựa trên điều này chúng
      ta có 2 loại thẻ chính là: <strong>thẻ block</strong> và
      <strong>thẻ inline</strong>.
    </p>
    <p>
      Thẻ inline và thẻ block có những điểm khác nhau chính mà các bạn cần lưu ý
    </p>
    <ul>
      <li>
        Thẻ inline sẽ bị hạn chế về CSS như margin-top margin-bottom, padding-top,
        padding-bottom… khi sử dụng thẻ inline thì nên biết mà tuỳ trường hợp mà
        sử dụng, có thể dùng CSS để biến thẻ inline thành block hoặc inline block
      </li>
      <li>
        Khi các thẻ inline nằm cùng nhau thì nó sẽ nằm trên một hàng như tên gọi
        của nó là inline
      </li>
      <li>Thẻ inline sẽ có độ rộng bằng nội dung mà nó chứa</li>
      <li>Thẻ block sẽ có độ rộng full 100% phần tử cha chứa nó</li>
      <li>Thẻ block không bị hạn chế về CSS</li>
      <li>
        Vì thẻ block full 100% phần tử cha chứa nó cho nên khi dùng thẻ block cùng
        với nhau thì các phần tử đó sẽ rớt xuống hàng
      </li>
      <li>
        Thẻ inline và thẻ block có thể sử dụng cùng với nhau, điển hình là thẻ a
        nằm trong thẻ p khi các bạn đọc bài viết có gắn link vào để các bạn nhấn
        vô được
      </li>
    </ul>
    <pre><code class='language-html' lang='html'>&lt;p&gt;You can&lt;a href=&quot;google.com&quot;&gt;click here&lt;/a&gt;&lt;/p&gt;
          </code></pre>
    <ul>
      <li>
        Khi sử dụng CSS biến thẻ thành inline-block thì nó là sự kết hợp giữa thẻ
        inline và thẻ block, tức là nó sẽ có độ rộng theo nội dung nó chứa mà
        thôi(đặc điểm của thẻ inline), và không bị hạn chế về CSS(đặc điểm của thẻ
        block), nằm gần nhau thì nằm trên 1 hàng(đặc điểm của thẻ inline)
      </li>
    </ul>
    <h1 id="cac-the-html-hay-dung-nhat">Các thẻ HTML hay dùng nhất</h1>
    <h2 id="the-div">Thẻ div</h2>
    <p>
      Là <strong>thẻ block</strong> và là thẻ được sử dụng rộng rãi nhất hiện nay.
      Thẻ div thường được dùng cho một khối nào đó lớn, bên trong khối đó có thể
      có nhiều khối nhỏ(cũng là thẻ div) hoặc các thẻ p, và nhiều thẻ khác, chính
      vì vậy, thẻ div là viết tắt của division tức là sự phân chia các mục. Có thể
      nói thẻ div là thẻ chung nhất và có thể đảm nhận nhiều chức năng của các thẻ
      khác, khi chưa có những thẻ đặc biệt tạo bố cục trang web, thì thẻ div sẽ
      được dùng để thay cho các thẻ đó. Ngoài ra, thẻ div cũng có thể chứa văn bản
      tương tự với thẻ văn bản(thẻ p), tuy nhiên chúng ta nên dùng thẻ p như sẽ
      được giới thiệu tiếp theo đây.
    </p>
    <pre><code class='language-html' lang='html'>&lt;div class = &quot;container&quot;&gt;
          &lt;div class = &quot;inside-container&quot;&gt;
              &lt;div&gt;This is div tag&lt;/div&gt;
          &lt;/div&gt;
          &lt;/div&gt;
          </code></pre>
    <h2 id="the-van-ban">Thẻ văn bản</h2>
    <p>
      Thẻ văn bản hay trong html là thẻ p, là <strong>thẻ block</strong> đặc trưng
      cho văn bản(paragraph) và theo mình cũng là thẻ cơ bản nhất trong html. Thẻ
      p có các thuộc tính hay dùng là class và id, nội dung thẻ p là các đoạn văn
      bản bất kì. Trên các trang web, các bạn có thể thấy rằng hầu hết các đoạn
      văn bản đều được chứa trong các thẻ p. Vì vậy, khi muốn viết một đoạn văn
      bản trên web, các bạn hãy ưu tiên bọc nó bằng thẻ p nhé.
    </p>
    <pre><code class='language-html' lang='html'>&lt;p&gt;Đây là một đoạn văn bản bất kì&lt;/p&gt;
          </code></pre>
    <h2 id="cac-the-tieu-de">Các thẻ tiêu đề</h2>
    <p>
      Các thẻ tiêu đề là những thẻ <code>h1,h2,h3,h4,h5,h6</code> là
      <strong>thẻ block</strong> và thường đại diện cho các tiêu đề từ to cho đến
      nhỏ và có cách sử dụng khác nhau (h1 là to nhất tới h6 là nhỏ nhất). Thẻ
      <strong>h1</strong> là thẻ thường được sử dụng cho một tiêu đề to nhất của
      trang web và lưu ý trong một trang web thì chỉ có
      <strong>tối đa một thẻ h1</strong> mà thôi, vì nó ảnh hưởng tới SEO cho nên
      nếu các bạn sử dụng nhiều hơn một thẻ h1 thì không tốt đâu nhé.
    </p>
    <pre><code class='language-html' lang='html'>&lt;h1&gt;This is heading 1&lt;/h1&gt;
          &lt;h2&gt;This is heading 2&lt;/h2&gt;
          &lt;h3&gt;This is heading 3&lt;/h3&gt;
          </code></pre>
    <p>
      Như tên gọi của nó thì nó được dùng cho cấu trúc có tiêu đề ví dụ như tiêu
      đề khối, tiêu đề bài viết, tiêu đề blog. Bên trong nó có thể chứa thẻ a,
      hoặc các thẻ inline khác, hay thẻ block… Và các bạn lưu ý các đoạn văn bản
      dài như ở thẻ p thì nên dùng thẻ p hoặc thẻ div chẳng hạn chứ đừng dùng
      những thẻ tiêu đề này cho một đoạn văn bản quá dài nhé.
    </p>
    <h2 id="the-lien-ket">Thẻ liên kết</h2>
    <p>
      Thẻ a là <strong>thẻ inline</strong>, dùng cho các liên kết, bạn có thể dùng
      thẻ này để liên kết đến các trang web khác hoặc liên kết đến các mục khác
      trong chính trang web hiện tại với điều kiện mục đó
      <strong>phải có id</strong> và trong <strong>thuộc tính href</strong> của
      thẻ a phải bắt đầu bằng <strong>dấu #</strong>
    </p>
    <pre><code class='language-html' lang='html'>&lt;a href = &quot;link&quot;&gt;Đây là liên kết đến trang web khác&lt;/a&gt;
          &lt;a href = &quot;#main&quot;&gt;Liên kết đến nội dung chính trong trang này&lt;/a&gt;
          &lt;div id = &quot;main&quot;&gt;Đây là nội dung chính&lt;/div&gt;
          </code></pre>
    <p>
      Trong thẻ a có 2 thuộc tính quan trọng đó chính là
      <code>href và target</code>, <strong>href</strong> sẽ truyền vào đường dẫn,
      hoặc <strong>id</strong> mục khác sau dấu #, <strong>target</strong> thì có
      2 giá trị thường được sử dụng nhất là <code>_self</code> và
      <code>_blank</code>, <strong>_self</strong> thì nó sẽ mở trong tab hiện tại
      luôn(dễ hiểu hơn nó sẽ thay thế tab hiện tại trên trình duyệt bằng link các
      bạn nhấn vào), còn <strong>_blank</strong> nó sẽ mở ra một tab mới trên
      trình duyệt. Nội dung của thẻ a sẽ là văn bản hiện ra trực tiếp với người
      dùng mà khi bấm vào sẽ dẫn tới đường link trong thuộc tính
      <strong>href</strong>, vì vậy các bạn nên đặt nội dung thẻ a tường minh, rõ
      ý nhé.
    </p>
    <pre><code class='language-html' lang='html'>&lt;a href=&quot;https://google.com&quot; target = &quot;_blank&quot;&gt;google.com&lt;/a&gt;
          </code></pre>
    <p>
      Bên trong thẻ a có thể chứa nhiều thẻ khác luôn nhé như thẻ block khác, thẻ
      inline… Sau này các bạn code giao diện mà có cho người dùng nhấn vào một
      khối nào đó thì chắc chắn các bạn sẽ dùng thẻ a bao lại hết chúng.
    </p>
    <h2 id="the-img">Thẻ img</h2>
    <p>
      Là <strong>thẻ inline</strong> và là <strong>thẻ tự đóng</strong> nên không
      truyền nội dung vào giữa như các thẻ đóng mở khác được. Thẻ này sử dụng rất
      nhiều trong trang web để hiển thị hình ảnh, thẻ img có 2 thuộc tính chính mà
      các bạn cần nắm đó là <code>src</code> và <code>alt</code> trong đó
      <strong>src</strong> truyền vào đường dẫn hình ảnh để hiển thị hình ảnh lên
      trang web, còn thẻ <strong>alt</strong> thì là liên quan tới SEO một chút,
      khi hình ảnh đường dẫn sai sẽ không hiển thị được thì nội dung trong thẻ alt
      sẽ hiển thị lên.
    </p>
    <pre><code class='language-html' lang='html'>&lt;img src = &quot;google_image.png&quot; alt = &quot;google_image&quot;&gt;
          </code></pre>
    <p>
      Ngoài ra, như đã nói ở thẻ liên kết, bạn hoàn toàn có thể bọc thẻ img trong
      một thẻ a nếu muốn khi người dùng nhấp vào hình ảnh sẽ dẫn đến một trang
      khác.
    </p>
    <h2 id="the-danh-sach">Thẻ danh sách</h2>
    <p>
      Thẻ danh sách thì có 2 thẻ chính với cấu trúc hay dùng là
      <code>ul li</code> và <code>ol li</code>. Trong đó <strong>ul</strong> nghĩa
      là <strong>unorderedlist</strong> nghĩa danh sách không có thứ tự, tức là
      khi dùng nó sẽ hiển thị dưới dạng như này với các chấm tròn mặc định hoặc
      vuông dựa vào CSS sẽ nói sau này.
    </p>
    <ul>
      <li>a</li>
      <li>b</li>
    </ul>
    <p>
      Còn <strong>ol</strong> là <strong>orderedlist</strong> nghĩa là danh sách
      có thứ tự tức được đánh số như mục lục vậy 1 2
    </p>
    <ol start="">
      <li>a</li>
      <li>b</li>
    </ol>
    <p>
      Thẻ danh sách được sử dụng nhiều để liệt kê các nội dung hoặc ở trường hợp
      để làm các mục của menu trang web
    </p>
    <pre><code class='language-html' lang='html'>&lt;p&gt;Things cats like:&lt;/p&gt;
          &lt;ul class = &quot;cat-hobbies&quot;&gt;
          &lt;li&gt;Milk&lt;/li&gt;
          &lt;li&gt;Fish&lt;/li&gt;
          &lt;li&gt;Sleeping&lt;/li&gt;
          &lt;/ul&gt;
          </code></pre>
    <h2 id="cac-the-semantic">Các thẻ semantic</h2>
    <p>
      Với nhu cầu code web ngày càng phổ biến và rỗng rãi hơn, các thẻ semantic
      được tạo ra nhằm để giúp cho trang web có cấu trúc mạch lạc, khoa học hơn,
      nhất là những trang web về các bài báo hay các bài blog. Điều này là hoàn
      toàn hợp lý bởi vì lượng người dùng trang web càng ngày càng nhiều và chúng
      ta không chỉ sử dụng web trên các thiết bị nhìn mà còn có cả các thiết bị
      nghe. Chính vì vậy, cấu trúc web rõ ràng, mạch lạc các phần là điều rất quan
      trọng để các thiết bị này có thể phân biệt và truyền tải nội dung đến người
      dùng. Một số thẻ semantic có thể kể đến như:
      <code
        >thẻ header, thẻ footer, thẻ aside, thẻ article, thẻ main, thẻ
        section,...</code
      >
    </p>
    <p>
      Chúng ta có thể nhận thấy rằng tên các thẻ semantic hiển thị rõ ý nghĩa và
      chức năng của từng thẻ. Trước khi có các thẻ này người ta thường dùng thẻ
      div kèm với id hay class để chia các thành phần trang bởi vì tính chất của
      các thẻ này là như nhau. Mặc dù vậy, các bạn mới làm quen với HTML nên học
      dùng các thẻ này luôn để có cái nhìn tổng quát về cấu trúc trang web.
    </p>
    <figure>
      <img
        src="https://i.postimg.cc/NjQ1RFb7/semantic-tag.jpg"
        referrerpolicy="no-referrer"
        alt="Sematic_tags"
      />
      <figcaption>Semantic tags</figcaption>
    </figure>
    <h2 id="cac-the-dinh-dang-van-ban">Các thẻ định dạng văn bản</h2>
    <p>
      Là các thẻ inline, có chức năng làm nổi bật các đoạn chữ ngắn hoặc căn chỉnh
      các thành phần theo nhu cầu của người tạo web. Một số thẻ thường dùng như
      thẻ <code>strong</code> và thẻ <code>b</code> làm cho chữ
      <strong>in đậm</strong>, thẻ <code>em</code> và thẻ <code>i</code> để làm
      chữ <em>in nghiêng</em>, thẻ <code>br</code> để xuống dòng,...
    </p>
    <pre><code class='language-html' lang='html'>&lt;p&gt;
          &lt;b&gt;Dòng này được in đậm&lt;/b&gt;
          &lt;br&gt; &lt;!-- Xuống dòng --&gt;
          &lt;em&gt;Dòng này được in nghiêng&lt;/em&gt;
          &lt;/p&gt;
          </code></pre>
    <p>&nbsp;</p>
    <h1 id="tam-ket">Tạm kết</h1>
    <p>
      Vậy là mình đã giới thiệu cho các bạn một số thẻ thông dụng trong HTML.
      Những thẻ này trông thì rất cơ bản và đơn giản nhưng lại đóng vai trò vô
      cùng quan trọng trong tất cả các trang web, với những thẻ này các bạn đã
      hoàn toàn có thể tạo riêng cho mình một trang web trình bày thông tin đơn
      giản rồi đấy. Cảm ơn các bạn đã đọc bài viết của mình và chúc các bạn học
      code vui vẻ!
    </p>
  </div>
  ",
    "authorName": "Nguyen Duy",
    "timeRelease": "2021-11-02T16:40:00Z",
    "timeCreate": "2021-11-05T22:10:00Z",
    "title": "Giới thiệu các thẻ cơ bản trong HTML",
    "subTitle": "Chỉ với một số thẻ HTML thông dụng, bạn đã hoàn toàn có thể tạo riêng cho mình một trang web đơn giản.",
    "coverImgUrl": "https://i.postimg.cc/Pxd949bB/E22-DEBD9-B3-B7-45-AE-9-F8-D-E64-C123-D0473.jpg",
    "thumbnailImgUrl": "https://i.postimg.cc/PrXv9R9b/HTML-thumbnail.png",
    "blogTag": ["HTML", "Web Development"]
  }