{
    "rawContent": "<div class='post-body'>\n\n    <p>Lập trình là một kĩ năng vô cùng hữu dụng có thể giúp bạn thăng tiến trong sự nghiệp. Nó cũng có thể là một thú\n        vui vô cùng bổ ích giúp bạn rèn luyện tư duy. Để học lập trình, bạn không bắt buộc phải bỏ ra hàng chục ngàn\n        đô-la để đi học đại học; bạn có thể tự học tại nhà. Bài viết này sẽ chia sẻ cách bạn có thể tự học lập\n        trình.</p>\n    <p>Trong bài viết này có những cụm từ được <em>in nghiêng</em> - đó là những thuật ngữ có thể bạn sẽ thấy mới mà người viết\n        không giải thích rõ vì không thuộc trọng tâm bài viết, các bạn có thể tự tìm hiểu. Nhân đây, chúng tôi xin đưa\n        ra lời khuyên đầu tiên dành cho những người học lập trình: hãy học cách tận dụng Google!</p>\n\n    <figure>\n        <img src='https://i.postimg.cc/9QZrp4CN/hv-Mib-Do8-Efu8-Brcm-IQ5-OFyos-Gc-R-0fg-Fq5v-ESYpf0.png'\n             alt='Teach yourself C++ in 21 days'>\n        <figcaption>Ảnh đùa: Cách tự học lập trình trong 21 ngày <em>(nguồn: <a href='https://abstrusegoose.com/249'>The\n            Abstruse Goose</a>)</em></figcaption>\n    </figure>\n\n    <h1 id='xac-dinh-muc-tieu'>Xác định mục tiêu</h1>\n    <p>Trước hết, hãy tự hỏi lại bản thân tại sao bạn muốn học lập trình. Bạn muốn làm một trang web, phân tích dữ liệu,\n        hay chế tạo robot? Bạn đang có một dự án cụ thể và nghĩ rằng bạn cần dùng đến <em>phần mềm</em>, hay bạn muốn\n        học lập trình chỉ đơn giản để biết lập trình là như thế nào? Những câu hỏi như thế này giúp bạn xác định các\n        ngôn ngữ lập trình bạn cần học. Ngôn ngữ lập trình là ngôn ngữ mà bạn sử dụng để viết <em>chương trình</em> cho\n        máy tính. Mỗi vấn đề thường được giải quyết tối ưu bằng một số ngôn ngữ riêng, và mỗi ngôn ngữ thường thích hợp\n        cho một số công việc riêng. Trên thế giới hiện nay có… nhiều vấn đề cần giải quyết, và có khoảng 700 ngôn ngữ\n        lập trình; vì vậy, việc xác định một hay một vài ngôn ngữ bạn cần học là một bước đầu quan trọng.</p>\n    <p>Vậy, học lập trình, bạn có thể làm gì? Đây là một số ví dụ:</p>\n    <ul>\n        <li>Làm website: thiết kế giao diện các trang web (<em>front-end</em>), xây dựng các máy chủ (<em>back-end</em>)\n        </li>\n        <li>Làm <em>ứng dụng</em> cho điện thoại di động: ứng dụng sửa ảnh, chương trình soạn thảo văn bản, ứng dụng\n            chấm bài kiểm tra trắc nghiệm, trò chơi\n        </li>\n        <li>Lập trình <em>hệ thống nhúng</em>: viết phần mềm để điều khiển các hệ thống phần cứng như điều khiển ti-vi,\n            hệ thống tưới cây tự động, máy chụp cộng hưởng từ, robots\n        </li>\n        <li>Phân tích dữ liệu: phân tích dữ liệu người dùng sản phẩm, phân tích thị trường chứng khoán, phân tích hệ gen\n            sinh vật\n        </li>\n    </ul>\n    <p>Nếu bạn vẫn chưa có một mục tiêu cụ thể khi học lập trình, không sao hết. Cứ thử một định hướng bất kì thôi!</p>\n\n    <h1 id='chon-ngon-ngu-lap-trinh'>Chọn ngôn ngữ lập trình</h1>\n    <p>Nếu bạn là người chưa có mục tiêu cụ thể, hay chỉ đơn thuần muốn học lập trình để biết cái cảm giác làm một\n        hacker nó ngầu lòi đến mức nào, bạn có thể bắt đầu với Python hoặc JavaScript. Đây là hai ngôn ngữ tương đối\n        dễ học và có rất nhiều ứng dụng.</p>\n    <p>Sau đây là một số ngôn ngữ lập trình phổ biến nhất và một số ứng dụng quan trọng của chúng:</p>\n    <ul>\n        <li><strong>Java</strong>: Với triết lí “Write one, run anywhere”, Java được dùng rộng rãi để viết các\n            chương trình chạy trên nhiều nền tảng máy tính khác nhau một cách nhanh chóng. Java được dùng để phát\n            triển các ứng dụng Android và <em>Internet vạn vật</em>.\n        </li>\n        <li><strong>C++</strong>: Đây là ngôn ngữ thích hợp trong các trường hợp yêu cầu tốc độ chương trình cao và\n            <em>tài nguyên máy tính</em> hạn chế. C++ thường được dùng để lập trình <em>phần mềm hệ thống</em> như\n            <em>hệ điều hành</em> và các hệ thống nhúng như đồng hồ điện tử hay xe tự lái.\n        </li>\n        <li><strong>Python</strong>: Đây là ngôn ngữ được dùng nhiều nhất trong <em>Học máy</em>, <em>Trí tuệ Nhân\n            tạo</em> và <em>Khoa học Dữ liệu</em>. Nó cũng được sử dụng nhiều để làm back-end của các website.\n        </li>\n        <li><strong>JavaScript</strong>: Cùng với <em>HTML</em> và <em>CSS</em>, JavaScript ra đời để làm giao diện\n            các website. Ngày nay, JavaScript cũng được sử dụng nhiều cho back-end và nhiều mục đích khác.\n        </li>\n        <li><strong>Ruby</strong>: Ngôn ngữ này có nhiều ứng dụng, trong đó quan trọng nhất là phát triển back-end.\n        </li>\n        <li><strong>PHP</strong>: Ngôn ngữ đa năng này cũng được sử dụng nhiều nhất trong phát triển back-end.</li>\n        <li><strong>R</strong>: Ngôn ngữ này được dùng chủ yếu để làm phần mềm thống kê và phân tích dữ liệu.</li>\n        <li><strong>Swift</strong>: Đây là một ngôn ngữ được được sử dụng để phát triển các ứng dụng iOS.</li>\n        <li><strong>C#</strong>: Ứng dụng quan trọng nhất của C# là phát triển ứng dụng trên Windows và làm games.\n        </li>\n        <li><strong>Go</strong>: Ngôn ngữ này thường được sử dụng để phát triển các máy chủ và <em>hệ thống phân\n            tán</em>.\n        </li>\n        <li><strong>SQL</strong>: Đây thực ra không phải là một ngôn ngữ lập trình. Nó là ngôn ngữ dùng để quản lí\n            <em>cơ sở dữ liệu</em>.\n        </li>\n    </ul>\n    <p>Vậy, ví dụ bạn muốn học làm một website, bạn nên bắt đầu với HTML, CSS và JavaScript. Nếu bạn có định hướng\n        theo ngành Khoa học Dữ liệu, bạn có thể học Python và R. Nếu bạn muốn làm một hệ thống nhúng, bạn nên học\n        C++ và <em>Arduino</em>. Tóm lại, hãy tìm hiểu các lĩnh vực trong Khoa học Máy tính, rồi khi đã chọn được\n        một hoặc vài lĩnh vực bạn quan tâm, hãy tìm hiểu những ngôn ngữ lập trình hữu ích nhất đối với lĩnh vực đó\n        để học.</p>\n    <p>Bạn cũng không nên quá lo lắng về việc làm thế nào để chọn đúng lĩnh vực mình thích, hay liệu mình đã chọn\n        đúng ngôn ngữ lập trình phù hợp nhất hay chưa. Nói thật là rất khó để biết được bạn có đam mê với lĩnh vực\n        gì cho đến khi bạn thực sự đã học nhiều và làm dự án về nó. Và dù bạn có chọn lĩnh vực hay ngôn ngữ nào, hãy\n        nhớ rằng khi học lập trình, bạn cũng học được cách tư duy để giải quyết vấn đề vô cùng hữu ích.</p>\n\n    <h1 id='hoc-cac-khai-niem-co-ban'>Học các khái niệm cơ bản</h1>\n    <p>Khi đã có một chút ý tưởng về lĩnh vực và ngôn ngữ lập trình bạn muốn tìm hiểu, hãy bắt đầu học những khái\n        niệm cơ bản nhất về máy tính. Bạn cần biết máy tính là gì, máy tính được tạo nên từ những bộ phận nào, phần\n        mềm là gì, ứng dụng là gì, lập trình là gì, thuật toán là gì, mã nguồn và mã máy là gì, biên dịch và thông\n        dịch là sao, IDE là gì, Internet hoạt động thế nào, v.v. Nói chung là bạn cần hiểu ở mức độ sơ đẳng làm thế\n        nào cái đống kim loại trên bàn làm việc của bạn có thể lưu trữ thông tin và tính toán, từ đó giúp con người\n        học tập, giải trí, kinh doanh... Bạn có thể bắt đầu với <a\n                href='https://codeburst.io/intro-to-computer-science-terminology-f9ae64e75d27' target='_blank'>bài\n            viết này</a>. Đây là bước rất quan trọng giúp bạn có nền tảng để học bất cứ thứ gì liên quan đến Khoa\n        học Máy tính.</p>\n    <p>Tiếp đó, hãy học các khái niệm cơ bản về ngôn ngữ lập trình như biến, hàm, điều kiện, toán tử, kiểu dữ liệu\n        và vòng lặp. Trên Internet có rất nhiều nguồn tài liệu và khoá học lập trình miễn phí mà chúng tôi sẽ liệt\n        kê và hướng dẫn bạn cách tìm ở bài viết sau.</p>\n    <p>Một vài lưu ý:</p>\n    <ul>\n        <li>Hãy nhớ một điều quan trọng là đừng chỉ đọc lí thuyết, cũng đừng chỉ đọc ví dụ code mẫu. Bạn phải thực\n            hành thì mới hiểu sâu và thành thạo sử dụng các tính năng của ngôn ngữ lập trình được. Khi đọc code mẫu,\n            ít nhất bạn phải chạy nó, rồi có thể tìm cách thay đổi chỗ này chỗ nọ để xem tại sao lại phải viết code\n            như thế này, viết khác đi có cho kết quả khác không, nếu có thì khác như thế nào, tại sao lại như vậy…\n            Các khoá học thường sẽ đưa ra những bài tập nhỏ để bạn vận dụng những kiến thức bạn vừa học; hãy làm\n            chúng. Bạn cũng hãy tự đặt ra cho mình những dự án nhỏ để làm, ví dụ như làm một ứng dụng máy tính bỏ\n            túi với các phép toán đơn giản, làm một trang web để ghi những việc cần làm trong ngày (to-do list), hay\n            làm một cái đèn tự bật trong một căn phòng khi có người vào.\n        </li>\n        <li>Nếu bạn là người mới bắt đầu học lập trình, hãy học đến mức nắm chắc tất cả những tính năng cơ bản của\n            một ngôn ngữ bạn đã chọn trước. Đừng nhảy hết ngôn ngữ này đến ngôn ngữ khác. Quá trình học ngôn ngữ lập\n            trình đầu tiên sẽ khó khăn, nhưng khi bạn đã nắm chắc những khái niệm cơ bản về lập trình, việc học các\n            ngôn ngữ tiếp theo khi bạn có nhu cầu sẽ đơn giản hơn nhiều.\n        </li>\n    </ul>\n\n    <h1 id='hoc-cau-truc-du-lieu-va-thuat-toan'>Học các cấu trúc dữ liệu và thuật toán</h1>\n    <p>Khi bạn đã thoải mái với một ngôn ngữ và đã viết được những chương trình đơn giản, hãy học các cấu trúc dữ\n        liệu và thuật toán. Đây có thể coi là linh hồn của Khoa học Máy tính.</p>\n    <ul>\n        <li><strong>Cấu trúc dữ liệu</strong> là một cách tổ chức dữ liệu trong máy tính sao cho nó có thể được sử\n            dụng hiệu quả.\n        </li>\n        <li><strong>Thuật toán</strong>, hay <strong>giải thuật</strong>, là một dãy hữu hạn các thao tác được sắp\n            xếp theo một trình tự xác định sao cho sau khi thực hiện dãy thao tác ấy, từ dữ liệu đầu vào của bài\n            toán, ta nhận được dữ liệu đầu ra cần tìm.\n        </li>\n    </ul>\n    <p>Một vấn đề có thể được giải quyết bằng nhiều thuật toán khác nhau nhưng có những thuật toán sẽ tốn thời gian\n        và bộ nhớ hơn những thuật toán khác, và không phải bất cứ cấu trúc dữ liệu nào cũng có phù hợp cho mọi vấn\n        đề; vì vậy, học các cấu trúc dữ liệu và thuật toán một cách bài bản giúp bạn có khả năng giải quyết các vấn\n        đề phức tạp một cách hiệu quả.</p>\n    <p>Các tài liệu và khoá học về Cấu trúc dữ liệu và Thuật toán cũng có rất nhiều trên mạng; chúng tôi sẽ giúp bạn\n        tìm kiếm ở bài viết sau. Một lần nữa, đừng chỉ đọc lí thuyết suông hết thuật toán này đến thuật toán khác.\n        Hãy thực hành triển khai các thuật toán bạn học trong ngôn ngữ lập trình bạn đã học để giải quyết các bài\n        tập được đưa ra trong khoá học bạn theo học cũng như các vấn đề trong dự án cá nhân của bạn.</p>\n\n    <h1 id='lam-du-an'>Làm dự án</h1>\n    <p>Như đã nói, việc thực hành làm dự án phải bắt đầu sau khi bạn đã học hết cú pháp cơ bản của một ngôn ngữ lập\n        trình, các cấu trúc dữ liệu và thuật toán mà đan xen trong quá trình học lí thuyết. Nhưng khi đã nắm chắc\n        được những mảng lí thuyết trên, bạn có thể bắt đầu làm những dự án lớn, phức tạp hơn.</p>\n    <p>Một số lưu ý khi thực hành lập trình:</p>\n    <ul>\n        <li>Hãy học sử dụng các công cụ hỗ trợ việc phát triển phần mềm phù hợp với mục đích của bạn như <em>code\n            editor</em> (Visual Studio Code là một code editor hữu ích cho rất nhiều mục đích), <em>debugger</em>,\n            <em>thư viện</em>, và <em>Git</em>.\n        </li>\n        <li>Trong quá trình thực hành, sẽ có những lúc bạn không thể nghĩ ra cách làm một thứ gì đó hay gặp lỗi.\n            Những dòng báo lỗi đỏ dài loằng ngoằng khi bạn chạy chương trình có thể nhìn rất choáng ngợp. Đây là\n            những điều hết sức bình thường ai cũng sẽ trải qua khi học lập trình. Khi bạn muốn làm một việc gì đó mà\n            nghĩ mãi không được, hãy tra trên Internet. Cứ gõ vào Google “how to [do something] in [programming\n            language]”. Khi màn hình báo lỗi, hãy bình tĩnh đọc để biết lỗi ở đâu để sửa. Nếu bạn đọc mà không hiểu,\n            lại copy tin nhắn lỗi lên Google để tra. Khi bạn tra cứu những vấn đề liên quan đến lập trình, bạn\n            thường sẽ thấy kết quả một trang tên là Stack Overflow. Đây là trang web để những người lập trình hỏi và\n            trả lời các câu hỏi của nhau. Nếu bạn đã tra Google rất kĩ mà vẫn chưa tìm được câu trả lời cho mình,\n            bạn có thể lên Stack Overflow tự đặt câu hỏi; sau một thời gian sẽ có người trả lời.\n        </li>\n        <li>Đừng quá cố gắng viết một phần code hoàn hảo ngay từ đầu, bởi thực tế là không có phần mềm nào hoàn hảo.\n            Quá cầu toàn sẽ khiến bạn mất thời gian mà sẽ chẳng bao giờ xong việc. Hãy cứ tiếp tục code, rồi vài\n            ngày sau quay lại đọc những gì bạn đã viết để xem bạn có thể sửa phần nào cho chương trình hiệu quả hơn\n            hay code dễ hiểu hơn không. Bạn có thấy đến những ứng dụng nổi tiếng như Facebook hay hệ điều hành\n            Windows của Microsoft sau bao năm tồn tại vẫn suốt ngày phải cập nhật mà không bao giờ hết lỗi không?\n            Vậy đừng tuyệt vọng khi chương trình của bạn có lỗi; hãy bình tĩnh và kiên trì, mỗi ngày bạn sẽ cải\n            thiện được code của mình nhiều hơn.\n        </li>\n        <li>Nhớ nguyên tắc “clean code”. Vì lỗi khi lập trình là không thể tránh khỏi, mã nguồn bạn viết không chỉ\n            nên làm chương trình hoạt động mà còn nên dễ hiểu (“sạch”) để sau này đọc lại, bạn, và những người hợp\n            tác với bạn, có thể sửa lỗi và thêm tính năng một cách dễ dàng. Bạn có thể tìm hiểu sâu các quy tắc code\n            sạch trong cuốn “Clean Code” của Robert C. Martin. Về cơ bản, nội dung nguyên tắc code sạch xoay quanh\n            một số câu hỏi như “Tên biến của mình đã dễ hiểu và thống nhất chưa?”, “Mỗi hàm của mình đã có một chức\n            năng chưa, hay mình đang nhét lộn xộn mọi thứ?”, “File mã nguồn của mình có đang quá dài, có quá nhiều\n            <em>classes</em> không, có nên cắt nó sang một file mới không?”, v.v.\n        </li>\n        <li>Hãy đọc code của những người khác trên <em>GitHub</em> và Stack Overflow, bạn sẽ học được nhiều từ những\n            người đi trước giàu kinh nghiệm. Và đừng quên nguyên tắc không đọc chay như đã nói ở trên. Bạn thậm chí\n            còn có thể đóng góp code của bạn cho họ nếu bạn phát hiện những chỗ bạn có thể làm tốt hơn họ.\n        </li>\n    </ul>\n\n    <h1 id='tiep-tuc-kham-pha'>Tiếp tục khám phá</h1>\n    <p>Ngành Khoa học Máy tính có rất nhiều linh vực để bạn khám phá như Trí tuệ nhân tạo, <em>Điện toán đám\n        mây</em>, <em>Blockchain</em>, <em>Tin sinh học</em>, <em>Máy tính lượng tử</em>, <em>Khoa học máy tính lí\n        thuyết</em> ,v.v. Sau khi đã học một ngôn ngữ lập trình, làm một dự án trong một lĩnh vực, hãy không ngừng\n        tiếp tục tìm hiểu những lĩnh vực khác và những ngôn ngữ khác. Càng khám phá và luyện tập nhiều, bạn sẽ càng\n        trở thành một lập trình viên, rồi một nhà khoa học máy tính, giỏi hơn.</p>\n\n</div>",
    "authorName": "Hoàng Xuân Việt",
    "timeRelease": "2021-11-06T01:59:40Z",
    "timeCreate": "2020-05-06T11:49:20Z",
    "title": "Cách tự học lập trình",
    "subTitle": "Để học lập trình, bạn không bắt buộc phải bỏ ra hàng chục ngàn đô-la để đi học đại học; bạn có thể tự học tại nhà. Bài viết này sẽ chia sẻ cách bạn có thể tự học lập trình.",
    "coverImgUrl": "https://i.postimg.cc/rp8bMD4h/IMG-1456.jpg",
    "thumbnailImgUrl": "https://i.postimg.cc/9QZrp4CN/hv-Mib-Do8-Efu8-Brcm-IQ5-OFyos-Gc-R-0fg-Fq5v-ESYpf0.png",
    "blogTag": ["Programming"]
}