{
  "rawContent": "<div class=\"post-body\">\n<h1 id=\"gi-c-m-p-chi-u-thu-v-c-n-c-m-ng-dai-d-ng\">Giấc mơ đẹp chiều thu và cơn ác mộng dai dẳng</h1>\n<p><img src=\"https://i.postimg.cc/kM8TYvF2/day-1.jpg\" alt=\"\"></p>\n<p>Chẳng ai học ở Trường Đại học Bách Khoa Hà Nội mà chưa nghe qua về truyền thuyết làm chủ một môn học nào đó trong một đêm. Tôi cũng là một phần của truyền thuyết này.</p>\n<p>Câu chuyện thì phải có đầu có đuôi. Số là năm ngoái, một hôm nào đó vào tầm 5 giờ chiều, tôi vẫn còn đang ngồi chơi điện tử (như mọi hôm), bỗng nghe bố mẹ bảo vừa đủ điểm đậu vào cái ngành nào đó mang tên cũng ngầu ngầu là Khoa học dữ liệu và Trí tuệ nhân tạo.</p>\n<p>Tôi sướng lắm, tôi tự hào lắm, vừa học gần nhà, vừa mang cái danh thi Đại học được 28+, lại không phải bỏ cả chục củ học tiếng Anh, mà còn đỗ ngành IT, vua của mọi nghề. Phải rồi, tôi nghĩ tôi đã thành công rồi, tôi là winner rồi. Tuổi trẻ.</p>\n<p>Những buổi học đầu tiên, vào trường cũng chẳng phải lần đầu lần hai. Nhìn bọn cùng trang lứa cứ nhìn điện thoại rồi lại ngước mắt nhìn ra phía cổng, tôi biết ngay chúng nó đang tìm tòa nhà. Non.</p>\n<p>Vào lớp học, tôi chẳng quen biết ai, chỉ biết cái từ &quot;non&quot; mà tôi vừa mới lỡ miệng thốt ra lúc nãy chính là sai lầm đầu tiên của thời sinh viên. Chúng nó học giỏi kinh khủng, mà đã học giỏi lại còn học trước thì ai chơi lại các bạn?</p>\n<p>Cơ mà tôi không lấy đó làm mối bận tâm, tôi quyết định không học, mặc dù vẫn đi đủ, vì tôi xem qua thấy nó cũng dễ thôi, bao giờ có lịch thi hẵng học. Tôi học Giải tích 1 trong 1 tuần, viết kín sạch 200 trang A4 Campus, và Đại số trong 1 buổi tối, điểm cũng không tệ. Vì kỳ đó tôi học ít môn quá, nên tôi ảo tưởng rằng học đại học chẳng có gì khó.</p>\n<p>Tôi tiếp tục giữ cái tư tưởng đấy cho đến kỳ hai. Và tôi nhận được (những) cú tát đầu tiên cho sự ảo tưởng của mình. Kỳ này khoảng 1/3 học offline, 2/3 học online. Nhìn chung tôi cũng chẳng học gì. Ngoài giờ học trên Teams ra, bạn luôn có thể liên lạc với tôi qua tin nhắn trong Liên Minh Huyền Thoại. Sau đó là một đợt hoãn thi liên tiếp rất dài. Chúng nó nô nức học kỳ hè trong đợt đó, còn tôi thì cho rằng nên dứt điểm mấy môn cũ trước, nên tôi bỏ kỳ hè. Tôi là một người kiên định, tôi đợi đến khi có lịch thi tôi mới học.</p>\n<p>Trái với kỳ trước, kỳ này tôi gần như không học kịp gì cả. Đờ i đi. &quot;Còn gì nữa đâu mà khóc với sầu...?&quot;. Khoảng 4, 5 tháng không học hành gì thì não tôi nhét chữ sao vào được. Mấy tuần gần đây, những con điểm xấu quắc liên tiếp được thêm vào ctt-sis.</p>\n<p>Chưa kịp hết bàng hoàng vì nhìn mấy con điểm kỳ trước, tôi lại phải xem cái thời khóa biểu 21 tín chỉ dày đặc, và toàn buổi sáng. Bình thường tôi vẫn chào buổi sáng vào lúc 12 giờ thì tôi học quả lịch này kiểu gì?</p>\n<p>Đã buồn ngủ vì phải dậy lúc 6h30 sáng tới 5 ngày một tuần, tôi lại được các bộ môn Toán thân yêu ru ngủ thêm. Sau cú tát kỳ trước, thì tôi cũng có tinh thần ham học rồi, nhưng mà cái tinh thần ấy không thể lớn hơn cơn buồn ngủ của tôi được.</p>\n<p>Đến nay cũng đã được vài tuần kể từ khi tôi được họ hàng biết đến với cái chức &quot;Sinh viên năm 2&quot;. Cơn buồn ngủ ấy vẫn còn dai dẳng. Còn về mặt kiến thức, tôi cảm giác như mình mới vào trường buổi chiều hôm qua. Non.</p>\n<p>Thỉnh thoảng tôi vẫn tỉnh dậy giữa giấc mơ trưa vì chợt nhớ ra mình chưa học cải thiện Giải tích 2.</p>\n<p>Hà Nội, ngày 17/10/2021. <br>\n@htnminh</p>\n<h1 id=\"c-ng-th-c-to-n-h-c-c-a-nh-g-i-xe-d6\">Công thức toán học của nhà gửi xe D6</h1>\n<p><img src=\"https://i.postimg.cc/05fstTkY/DSCF7550.jpg\" alt=\"\"></p>\n<p>Buổi học đầu tiên của tôi, một tân sinh viên K65. Tôi rất háo hức, nhưng tôi vẫn chưa quen lắm với việc phải dậy sớm đến vậy. 12 giờ 10, mở mắt. 12 giờ 25, lên xe. 5 phút sau, có mặt ở lớp học trên tòa nhà D8. Không lệch nửa giây.</p>\n<p>Kể ra nhà gần trường cũng sướng...</p>\n<p>Chắc hẳn ai trong số các bạn cũng đã từng có một buổi chiều với diễn biến tâm trạng giảm nhanh, giống nửa bên phải của cánh cổng Parabol ấy. Tôi háo hức, tôi ổn, tôi cảm thấy không ổn, tôi mệt quá, lực bất tòng tâm. Bạn đã hiểu ngày hôm đó của tôi, xin chúc mừng.</p>\n<p>Những dấu tích phân hình chữ S, rồi hàng chữ nhấp nhô cứ chạy dài trên slide, tôi chỉ nhớ chúng có đuôi là &quot;dx&quot;. Y như học tiếng Anh hồi cấp 3, đuôi nọ đuôi kia. &quot;Sets&quot;? Tập hợp? Toán trẻ con à? Rồi tôi cũng chẳng để tâm lắm... Tóm lại, tâm trạng tôi đi từ &quot;tôi háo hức&quot; vào lúc 12 giờ 30, đến &quot;tôi mệt quá&quot; vào lúc 5 giờ 30 phút.</p>\n<p>Biết trước đã giàu. Ai mà ngờ được, hằng hà sa số công thức lướt qua mắt tôi ngày hôm ấy, tôi sẽ khắc ghi trong lòng một công thức toán học, suốt cả cuộc đời này...</p>\n<p>Tan học. Bình thường hồi cấp 2 cấp 3, thì tôi cũng sẽ vui lắm. Lớn rồi, không phải tôi không tận hưởng được cái niềm vui ấy nữa. Mà là tôi vẫn không biết tôi sẽ phải học lại kiến thức của ngày hôm nay như thế nào. Bật mí cho bạn, buổi học nào tôi cũng nghĩ về điều đó, đến khi về nhà thì tôi thường quên mất tiêu luôn, bởi vì...</p>\n<p>Đập vào mắt tôi sau khi vừa bước được nửa lòng bàn chân ra khỏi tòa nhà D8, chính là một dãy xe máy xe đạp xếp một hàng dài ngoẵng. Tôi tưởng ở đó đang có biến gì căng lắm, nên tôi chạy ra xem. Thì ra là đang xếp hàng để soát vé.</p>\n<p>5 giờ 35, tôi chạm được vào cái xe của mình, sau khi luồn lách như ninja qua hàng xe. 5 giờ 40, chiếc xe của tôi nhích được lên phía trước một chút. Hơi lâu. 5 giờ 45, &quot;Lên đi bạn ơi, nhìn gì thế?&quot;. 5 giờ 50, tôi vẫn đang rất kiên nhẫn. Cái nhà gửi xe to mà cửa ra nhỏ quá. 5 giờ 55, văng vẳng đâu đó tiếng chửi thề, còn tôi gần như khóc rồi. &quot;Lực bất tòng tâm&quot;. Mẹ ơi con đói quá. Cuối cùng cũng đến tôi. 6 giờ hơn, rút thẻ trả tiền xong, tôi phóng như bay, như vừa được thả khỏi chốn ngục tù, giải phóng khỏi ách nô lệ. Dù thế thì tâm trạng tôi cũng không thể tồi tệ hơn được nữa rồi.</p>\n<p>Trên đường về, tôi bắt đầu suy nghĩ. Đúng 5 giờ 30 tan học. Thời điểm tan học là hằng số. Số xe vào khoảng thời gian đó, mỗi tuần, trong một học kỳ, gần như không thay đổi. Số xe xếp hàng vào một thời điểm là hằng số. Đúng hai cái cửa ra, hoạt động hết công suất. Tỷ lệ số xe được ra chia thời gian là hằng số.</p>\n<p>Chính vì vậy, tôi đã đúc rút ra phương trình toán học ngắn gọn như sau, mạn phép đặt tên &quot;Công thức nhà gửi xe D6&quot;:<br>\nThời gian bạn phải đợi = (Thời điểm bạn chạm vào xe - 5h30) * 5</p>\n<p>Ví dụ như hôm đó, tôi chạm được vào xe của mình lúc 5h35, tức là tôi muộn 5 phút, nghĩa là tôi phải đợi 5 phút x 5 = 25 phút, đến đúng 6 giờ, không lệch nửa giây. Tôi đã chứng minh được công thức này, bằng cách thử nghiệm với các giá trị khác nhau của tham số &quot;Thời điểm bạn chạm vào xe&quot; trong mấy ngày sau đó. Tôi sẽ viết một bài báo khoa học về công thức này vào ngày tôi ra trường.</p>\n<p>Kể ra được ở ký túc xá lại sướng...</p>\n<p>Hà Nội, ngày 19/10/2021. <br>\n@htnminh</p>\n<hr>\n<blockquote>\n<p>Những bài viết của tôi trong <a href=\"https://www.facebook.com/events/262915309083816/\">Cuộc thi &quot;655 - A NEW ERA&quot;</a>:</p>\n<ul>\n<li>Ngày thứ nhất: Viết bài chia sẻ về trải nghiệm học tập tại Bách Khoa. <a href=\"https://www.facebook.com/events/262915309083816/?post_id=264141218961225&amp;view=permalink\">&quot;Giấc mơ đẹp chiều thu và cơn ác mộng dai dẳng&quot;</a>.</li>\n<li>Ngày thứ hai: Chia sẻ kinh nghiệm học tập online. <a href=\"https://www.facebook.com/events/262915309083816/?post_id=264925478882799&amp;view=permalink\">&quot;Nhà khoa học dữ liệu tương lai...&quot;</a>.</li>\n<li>Ngày thứ ba: Chia sẻ kỉ niệm đáng nhớ của sinh viên. <a href=\"https://www.facebook.com/events/262915309083816/?post_id=265604818814865&amp;view=permalink\">&quot;Công thức toán học của nhà gửi xe D6&quot;</a></li>\n</ul>\n</blockquote>\n</div>",
  "authorName": "Hoàng Trần Nhật Minh",
  "timeRelease": "2021-11-06T20:20:00Z",
  "timeCreate": "2021-11-04T20:20:00Z",
  "title": "Một thằng sinh viên năm hai Bách Khoa",
  "subTitle": "Đôi lúc đi học không chỉ để lấy kiến thức, mà còn để lưu giữ lại kỷ niệm cho sau này...",
  "coverImgUrl": "https://avatars.githubusercontent.com/u/82358580?s=400&u=54fd814fd392727bf7594a28e2cac4df27366632&v=4",
  "thumbnailImgUrl": "https://i.postimg.cc/05fstTkY/DSCF7550.jpg",
  "blogTag": ["HUST", "Student", "Story"]
}
