{
    "rawContent": "<div class=\"post-body\">\n\n    <h1 id = \"cac-the-loai-dien-toan-dam-may\">Các thể loại điện toán đám mây</h1>\n    <p>Hiểu về các loại điện toán đám mây và sự khác biệt giữa IaaS, PaaS và SaaS</p>\n\n    <h2 id = \"gioi-thieu-chung\"> Giới thiệu chung</h2>\n    <p>Trong quá khứ, các tổ chức đều phải mua, vận hành và duy trì hạ tầng và tài nguyên của họ.\n        Theo cách khác, một tổ chức cần phải tự quản lý <em> mạng lưới(Networking), kho(Storage),\n        máy chủ(Servers), Virtualisation, hệ điều hành(Operating Systems),... </em>\n    </p>\n\n    <p>Với điện toán đám mây, các tổ chức có thể quyền truy cập theo yêu cầu (on-demand access)\n        với các tài nguyên và hạ tầng được cung cấp và duy trì bởi một công ty khác. Những tài nguyên\n        này được cung cấp và được chia thành 3 loại: Cơ sở hạ tầng như một dịch vụ(IaaS), nền tảng như một \n        dịch vụ(PaaS) và phần mềm như một dịch vụ(SaaS).\n    </p>\n\n    <h2 id =\"co-so-ha-tang-nhu-mot-dich-vu-iaas\"> Cơ sở hạ tầng như một dịch vụ(IaaS)</h2>\n    <p>Ta sẽ đến với loại đầu tiên của điện toán đám mây, IaaS sẽ cung cấp các nền tảng cho IT đám mây,\n        chẳng hạn như các thành phần liên quan đến networking, storage space, phần cứng và virtualisation.\n    </p>\n\n    <p>IaaS khá tương đồng với các tài nguyên Công nghệ thông tin đã được duy trì một cách truyền thống bởi các \n        bộ phận Công nghệ thông tin. Nó sẽ cung cấp sự linh hoạt cũng như sự quản lí lớn khi quản lí các tài nguyên này.\n    </p>\n\n    <p>Trong hình bên dưới, các dịch vụ trong các ô màu xanh tương ứng với các dịch vụ mà\n        tổ chức cần để quản lí IaaS trong khi các dịch vụ trong ô màu cam được chính IaaS tự quản lý.\n    </p>\n\n    <figure>\n        <img\n                src=\"https://miro.medium.com/max/183/1*CQp7z73W-RyGDKpfRedYVA.png\"\n                alt=\"IaaS\"\n        />\n        <figcaption>IaaS</figcaption>\n    </figure>\n\n    <h2 id = \"nen-tang-nhu-mot-dich-vu-paas\">Nền tảng như một dịch vụ(PaaS)</h2>\n    <p>PaaS thêm một lớp ở trên IaaS bởi nó loại bỏ việc các tổ chức cần phải quản lí cơ\n        sở hạ tàng để họ chỉ cần tập trung vào việc phát triển và quản lí các ứng dụng tận dụng \n        các nguồn tài nguyên và hạ tầng CNTT.\n    </p>\n\n    \n    <p>Trong hình bên dưới, các dịch vụ trong các ô màu xanh tương ứng với các dịch vụ mà\n        tổ chức cần để quản lí PaaS trong khi các dịch vụ trong ô màu cam được chính PaaS tự quản lý.\n    </p>\n\n    <figure>\n        <img\n                src=\"https://miro.medium.com/max/183/1*2NvBLIo1MidsSi9aaVhhpw.png\"\n                alt=\"PaaS\"\n\n        />\n        <figcaption>PaaS</figcaption>\n    </figure>\n\n    <h2 id = \"phan-mem-nhu-mot-dich-vu-saas\">Phần mềm như một dịch vụ(SaaS)</h2>\n    <p>Loại cuối cùng của điện toán đám mây là SaaS, nó cung cấp cho các tổ chức một\n        sản phẩm hoàn chỉnh được xử lí và quản lí bởi một bên cung cấp thứ ba.\n    </p>\n\n    <p> Trong SaaS các tổ chức không cần lo về chuyện gì khác ngoại trừ việc họ sẽ làm thế\n        nào để tận dụng các nguồn dịch vụ và sản phẩm có được để đạt được một mục tiêu hoàn chỉnh.\n    </p>\n\n    <p> Một trong những ví dụ phổ biến nhất của SaaS là một dịch vụ email trên web\n        khi bạn chỉ cần gửi và nhận email, phần còn lại thuộc về trách nhiệm của bên cung cấp phần mềm.\n    </p>\n\n    <figure>\n        <img\n                src=\"https://miro.medium.com/max/183/1*Ola96SQgFyKlfL3l1W1G1Q.png\"\n                alt=\"SaaS\"\n        />\n        <figcaption>SaaS</figcaption>\n    </figure>\n    \n    <h2 id = \"ket-luan\">Kết luận:</h2>\n    <p>Qua bài viết trên mình mong các bạn có một cái nhìn tổng quan về một số thể loại của điện toán đám mây để có thể tìm hiểu tiếp sâu vào lĩnh vực này.</p>\n</div>",
    "authorName": "Nguyễn Đắc Tâm",
    "timeRelease": "2021-11-07T15:40:00Z",
    "timeCreate": "2021-11-07T18:00:00Z",
    "title": "Phân loại điện toán đám mây",
    "subTitle": "Hiểu về các loại điện toán đám mây và sự khác biệt giữa IaaS, PaaS và SaaS.",
    "coverImgUrl": "https://i.postimg.cc/Y0rh6pL7/166178997-1134812663651327-3287403337104072459-n.jpg",
    "thumbnailImgUrl": "https://i.postimg.cc/Jh3rPfLz/1200px-A-small-cup-of-coffee.jpg",
    "blogTag": ["Cloud Computing"]
}